In [0]:
import numpy as np
import pandas as pd

In [0]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}
df = pd.DataFrame(d)

In [0]:
df.dropna() 
#df.dropna(axis=1) #if you want to drop coloumn only then use axis =1

     A    B  C
0  1.0  5.0  1

In [0]:
# use thresh = it will leave the rows where there are atleast 2 non-nan values
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [0]:
#fil na values
df.fillna(value = 'Fill value')

            A           B  C
0           1           5  1
1           2  Fill value  2
2  Fill value  Fill value  3

In [0]:
#fill missing values with mean
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [0]:
#Group by

In [0]:
data = {'Company':['Goog', 'Goog', 'Msft', 'Msft', 'Fb', 'Fb'], 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'], 'Sales': [200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    Goog      Sam    200
1    Goog  Charlie    120
2    Msft      Amy    340
3    Msft  Vanessa    124
4      Fb     Carl    243
5      Fb    Sarah    350

In [0]:
byComp = df.groupby('Company')
byComp.mean()

         Sales
Company
Fb       296.5
Goog     160.0
Msft     232.0

In [0]:
byComp.sum()

         Sales
Company
Fb         593
Goog       320
Msft       464

In [0]:
byComp.sum().loc['Fb']

Sales    593
Name: Fb, dtype: int64

In [0]:
df.groupby('Company').count()

         Person  Sales
Company
Fb            2      2
Goog          2      2
Msft          2      2

In [0]:
#describe
#df.groupby('Company').describe()
df.groupby('Company').describe().transpose()

Company              Fb        Goog        Msft
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [0]:
#Merging, joining, concatenating

In [0]:
#pd.concat([df1,df2,df3]) # concatenation
# merdge
#   pd.merge(left,right,how = 'inner' , on = 'key')

In [0]:
#finding unique values
# df[col].unique() # return column

In [0]:
#pivot table
#df.pivot_table()

In [0]:
#DATA INPUT AND OUPUT
# CSV
#EXCEL
# HTML
#SQL

In [0]:
#pd.read_csv('filename')
#need df to write -> df = pd.read_csv('filename') -> df.to_csv('filename')

In [0]:
#pd.read_excel('Excel_Sample.xlsc', sheetname= 'filename')
#df.to_exel('Excel_sample2.xlsc', sheet_name = 'newfilename)

In [0]:
#html
# data = pd.read_html('https://urladdress.html') <- it gets passed in as list #web scraping

In [0]:
#sql
#from sqlalchemy import create_engine
#engine = create_engine('sqlite:///:memory:')
#df.to_sql('my_table', engine)
#sqldf = pd.read_sql('my_table', con=engine)